# Dispose Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupLoadOptions..::..Dispose Method
GroupLoadOptions Class See Also
---
Releases all resources used by the GroupLoadOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
GroupLoadOptions Class
Autodesk.Revit.DB Namespace